Yannas-Sun/e-skin-simulator/firmware/stm32/tests/acc_spi_array/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MUX_S0_Pin GPIO_PIN_0
#define MUX_S0_GPIO_Port GPIOA
#define MUX_S1_Pin GPIO_PIN_1
#define MUX_S1_GPIO_Port GPIOA
#define MUX_S2_Pin GPIO_PIN_2
#define MUX_S2_GPIO_Port GPIOA
#define MUX_S3_Pin GPIO_PIN_3
#define MUX_S3_GPIO_Port GPIOA
#define MUX_EN1_Pin GPIO_PIN_4
#define MUX_EN1_GPIO_Port GPIOA
#define ADC_CS1_Pin GPIO_PIN_0
#define ADC_CS1_GPIO_Port GPIOB
#define ADC_EOC1_Pin GPIO_PIN_10
#define ADC_EOC1_GPIO_Port GPIOB
#define HOST_IRQ_Pin GPIO_PIN_8
#define HOST_IRQ_GPIO_Port GPIOB
#define HOST_SYNC_Pin GPIO_PIN_9
#define HOST_SYNC_GPIO_Port GPIOB
#define ACC_ENABLE_Pin GPIO_PIN_13
#define ACC_ENABLE_GPIO_Port GPIOC
#define ACC_ADDR0_Pin GPIO_PIN_12
#define ACC_ADDR0_GPIO_Port GPIOB
#define ACC_ADDR1_Pin GPIO_PIN_0
#define ACC_ADDR1_GPIO_Port GPIOF
#define ACC_ADDR2_Pin GPIO_PIN_1
#define ACC_ADDR2_GPIO_Port GPIOF
#define ACC_ADDR3_Pin GPIO_PIN_9
#define ACC_ADDR3_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
